Revit 2024 API
Document.GetElement Method
Overload List
Name | Description
GetElement(String)
 Gets the Element referenced by a unique id string.
GetElement(ElementId)
 Gets the Element referenced by the input ElementId.
GetElement(Reference)
 Gets the Element referenced by the input reference.
See Also
Document Class
Document Members
Autodesk.Revit.DB Namespace